akshaym1995/Embedded-project/TM4C123GH6PM/main.c
#include <stdint.h>
#include <string.h>
#include <stdio.h>
#include <stdlib.h>
#include <stdbool.h>

#include "inc/tm4c123gh6pm.h"
#include "inc/hw_memmap.h"
#include "inc/hw_types.h"
#include "driverlib/gpio.h"
#include "driverlib/pin_map.h"
#include "driverlib/sysctl.h"
#include "driverlib/uart.h"
#include "driverlib/i2c.h"



#define CR   0x0D
#define LF   0x0A
#define BS   0x08
#define ESC  0x1B
#define SP   0x20
#define DEL  0x7F

#define UART_FR_TXFF            0x00000020  /* UART Transmit FIFO Full */
#define UART_FR_RXFE            0x00000010  /* UART Receive FIFO Empty */
#define UART_LCRH_WLEN_8        0x00000060  /* 8 bit word length */
#define UART_LCRH_FEN           0x00000010  /* UART Enable FIFOs */
#define UART_CTL_UARTEN         0x00000001  /* UART Enable */
#define SYSCTL_RCGC1_UART0      0x00000001  /* UART0 Clock Gating Control */
#define SYSCTL_RCGC2_GPIOA      0x00000001  /* port A Clock Gating Control */

#define GGA_Buffer_Size 80
#define GGA_Pointers_Size 20

char UART_InChar(void);
void UART_OutChar(char data);
void GPIOPortF_Handler(void);

void DisableInterrupts(void);

void EnableInterrupts(void);

void WaitForInterrupt(void);

void UART_HANDLER(void);

unsigned long int get_gpstime();
float get_latitude(unsigned char);
float get_longitude(unsigned char);
float get_altitude(unsigned char);
void convert_time_to_UTC(unsigned long int);
float convert_to_degrees(float);

void InitI2C(uint32_t BASE, bool mode);

uint32_t IsBMP180Available(void);
uint32_t IsTMP006Available(void);
uint32_t IsISL29023Available(void);
uint32_t IsMPUAvailable(void);

void MPU_init();
void MPU_Receive();
void delayMs(int);

float Dispx=0,Dispy=0,Dispz=0;
float xa,ya,za,T,xg,yg,zg;
float disp=0, thetax=0,thetay=0,thetaz=0;
float xa,ya,za,T,xg,yg,zg;
float intdisp=0, intthetax=0,intthetay=0,intthetaz=0;
float GPS_pos_X=0,GPS_pos_Y=0,GPS_pos_Z=0;
char GGA_Buffer[GGA_Buffer_Size];              /* to store GGA string */
char GGA_CODE[3];

unsigned char N_S, E_W;                        /* for getting direction polarity */
unsigned char GGA_Pointers[GGA_Pointers_Size]; /* to store instances of ',' */
char CommaCounter;
char Data_Buffer[15];
volatile unsigned int GGA_Index;
volatile unsigned char  IsItGGAString   = 0;

uint32_t ReadBMPCalData(int *Cal_Arr); // Look at this function for multi byte read

void LCD_String_xy(int a,int b, char *c)
{
  int  i=0;
while(c[i]!='\0')
{
 printf("%c",(c[i]));
 i++;
}
printf("\n");
}

void LCD_String(char *c)
{
 int   i=0;
while(c[i]!='\0')
{
 printf("%c",((c[i])));
 i++;
}
printf("\n");
}





void DisableInterrupts(void)

{

    __asm ("    CPSID  I\n");

}




void EnableInterrupts(void)

{

    __asm  ("    CPSIE  I\n");

}


void WaitForInterrupt(void)

{

    __asm  ("    WFI\n");

}

char UART_InChar(void)
{


      while( (UART1_FR_R & UART_FR_RXFE) != 0)
          ;
         return((char)(UART1_DR_R & 0xFF));
}

void UART_Init(void)
{
    SYSCTL_RCGCUART_R |= 0x02;            /* activate UART0 */
    SYSCTL_RCGCGPIO_R |= 0x02;            /* activate port A */

    while((SYSCTL_PRGPIO_R&0x0002) == 0){}; /* ready? */

    UART1_CTL_R &= ~UART_CTL_UARTEN;      /* disable UART */
    UART1_IBRD_R = 104;        /* IBRD = int(16,000,000 / (16 * 115,200)) = int(8.680) */
    UART1_FBRD_R = 11;       /* FBRD = round(0.5104 * 64 ) = 44 */
    /* 8 bit word length (no parity bits, one stop bit, FIFOs) */
    UART1_LCRH_R = (UART_LCRH_WLEN_8);
    UART1_CTL_R |= UART_CTL_UARTEN;       /* enable UART */
    GPIO_PORTB_AFSEL_R |= 0x03;           /* enable alt funct on PA1-0 */
    GPIO_PORTB_DEN_R |= 0x03;             /* enable digital I/O on PA1-0 */
    GPIO_PORTB_PCTL_R = (GPIO_PORTB_PCTL_R&0xFFFFFF00)+0x00000011; /* configure PA1-0 as UART */
    GPIO_PORTB_AMSEL_R &= ~0x03;          /* disable analog functionality on PA */

    //----------------------INterrupt

//    UART1_ICR_R = 0x10;        /*  Clear flag4 */

  //  UART1_IM_R |= 0x10;        /*  arm interrupt on PF4 */

    // NVIC_PRI1_R = (NVIC_PRI1_R & 0xFF1FFFFF) | 0x00C00000;  /*  priority 5 */

    //NVIC_EN0_R = 0x00000040;        /*  Enable interrupt 5 in NVIC */

   // EnableInterrupts();             /* Enable global Interrupt flag (I) */

}


void  UART_HANDLER()
{
    printf("in interrupt");
    unsigned char received_char = UART_InChar();
    //c = UART_InChar();
    //UART_OutChar(c);     /* echo received char */
    UART1_ICR_R = 0x01;

                         /* Disable global interrupt */



        if(received_char =='$'){            /* check for '$' */
            GGA_Index = 0;
            IsItGGAString = 0;
            CommaCounter = 0;
        }
        else if(IsItGGAString == 1)
        {        /* if true save GGA info. into buffer */
            if(received_char == ',' )
                GGA_Pointers[CommaCounter++] = GGA_Index;    /* store instances of ',' in buffer */
            GGA_Buffer[GGA_Index++] = received_char;
        }
        else if(GGA_CODE[0] == 'G' && GGA_CODE[1] == 'G' && GGA_CODE[2] == 'A')
        { /* check for GGA string */
            IsItGGAString = 1;
            GGA_CODE[0] = 0; GGA_CODE[1] = 0; GGA_CODE[2] = 0;
        }
        else
        {
            GGA_CODE[0] = GGA_CODE[1];  GGA_CODE[1] = GGA_CODE[2]; GGA_CODE[2] = received_char;
        }
    }



unsigned long int get_gpstime(){
    unsigned char index;
    unsigned char Time_Buffer[15];
    unsigned long int _Time;
    memset(Time_Buffer,0,15);
    /* parse Time in GGA string stored in buffer */
    for(index = 0;GGA_Buffer[index]!=','; index++)
    {
        Time_Buffer[index] = GGA_Buffer[index];
    }
    _Time= atol(Time_Buffer);        /* convert string of Time to integer */
    return _Time;                    /* return integer raw value of Time */
}

float get_latitude(unsigned char lat_pointer)
{
    unsigned char lat_index = lat_pointer+1;    /* index pointing to the latitude */
    unsigned char index = 0;
    char Lat_Buffer[15];
    float _latitude;
    memset(Lat_Buffer,0,15);
    /* parse Latitude in GGA string stored in buffer */
    for(;GGA_Buffer[lat_index]!=',';lat_index++){
        Lat_Buffer[index]= GGA_Buffer[lat_index];
        index++;
    }
    lat_index++;
    N_S = GGA_Buffer[lat_index];
    _latitude = atof(Lat_Buffer);     /* convert string of latitude to float */
    return _latitude;                 /* return float raw value of Latitude */
}

