akshaym1995/Embedded-project/TM4C123GH6PM/main.c
float get_longitude(unsigned char long_pointer)
{
    unsigned char long_index;
    unsigned char index = long_pointer+1;       /* index pointing to the longitude */
    char Long_Buffer[15];
    float _longitude;
    long_index=0;
    memset(Long_Buffer,0,15);
    /* parse Longitude in GGA string stored in buffer */
    for( ; GGA_Buffer[index]!=','; index++){
        Long_Buffer[long_index]= GGA_Buffer[index];
        long_index++;
    }
    long_index++;
    E_W = GGA_Buffer[long_index];
    _longitude = atof(Long_Buffer);    /* convert string of longitude to float */
    return _longitude;                 /* return float raw value of Longitude */
}

float get_altitude(unsigned char alt_pointer)
{
    unsigned char alt_index;
    unsigned char index = alt_pointer+1;        /* index pointing to the altitude */
    char Alt_Buffer[12];
    float _Altitude;
    alt_index=0;
    memset(Alt_Buffer,0,15);
    /* parse Altitude in GGA string stored in buffer */
    for( ; GGA_Buffer[index]!=','; index++){
        Alt_Buffer[alt_index]= GGA_Buffer[index];
        alt_index++;
    }
    _Altitude = atof(Alt_Buffer);   /* convert string of altitude to float */
    return _Altitude;                   /* return float raw value of Altitude */
}

void convert_time_to_UTC(unsigned long int UTC_Time)
{
    unsigned int hour, min, sec;

    hour = (UTC_Time / 10000);                      /* extract hour from integer */
    min = (UTC_Time % 10000) / 100;                 /* extract minute from integer */
    sec = (UTC_Time % 10000) % 100;                 /* extract second from integer*/

    sprintf(Data_Buffer, "%d:%d:%d", hour,min,sec); /* store UTC time in buffer */

}

float convert_to_degrees(float NMEA_lat_long){

    float minutes, dec_deg, decimal;
    int degrees;
    float position;

    degrees = (int)(NMEA_lat_long/100.00);
    minutes = NMEA_lat_long - degrees*100.00;
    dec_deg = minutes / 60.00;
    decimal = degrees + dec_deg;
    if (N_S == 'S' || E_W == 'W') { // return negative
        decimal *= -1;
    }
    /* convert raw latitude/longitude into degree format */
    return decimal;
}
#define MINDIFF 2.25e-308                   // use for convergence check

double sqroot(double square)
{
    double root=square/3, last, diff=1;
    if (square <= 0) return 0;
    do {
        last = root;
        root = (root + square / root) / 2;
        diff = root - last;
    } while (diff > MINDIFF || diff < -MINDIFF);
    return root;
}

void compute_position(float Accx,float Accy,float Accz,float gx,float gy,float gz,float *Disp,float *thetax,float *thetay,float *thetaz)
{

   // float Dispx,Dispy,Dispz;
    double amplitude =0;

    Dispx+=Accx*0.01*0.01;
    Dispy+=Accy*0.01*0.01;
    Dispz+=Accz*0.01*0.01;
    amplitude=Dispx*Dispx+Dispy*Dispy+Dispz*Dispz;
    *Disp=(double)sqroot (amplitude);
    *thetax+=gx*0.01;
    *thetay+=gy*0.01;
    *thetaz+=gz*0.01;

}
#define PI 3.14
double sin(double x){
  double sign=1;
  if (x<0){
    sign=-1.0;
    x=-x;
  }
  if (x>360)
      x = x-(int)(x/360)*360;
  x*=PI/180.0;
  double res=0;
  double term=x;
  int k=1;
  while (res+term!=res){
    res+=term;
    k+=2;
    term*=-x*x/k/(k-1);
  }

  return sign*res;
}

double cos(double x){
  if (x<0) x=-x;
  if (x>360) x -= (int)(x/360)*360;
  x*=PI/180.0;
  double res=0;
  double term=1;
  int k=0;
  while (res+term!=res){
    res+=term;
    k+=2;
    term*=-x*x/k/(k-1);
  }
  return res;
}

float conv_gps_lat_long(float lat,float lon,float *x,float *y,float *z)
{
    int R= 6371000;

    *x = (float)R * cos (lat) * cos (lon);

    *y = (float)R * cos (lat) * sin (lon);

    *z = (float)R *sin (lat);

}

int main(void)
{   unsigned long int Time;
    float Latitude,Longitude,Altitude;
    int intLat,intLong,intAlt;

    char GPS_Buffer[15];
    char RxBuff[100]={};

    volatile uint32_t val;
    int cal_arr[11];

    SysCtlClockSet(SYSCTL_OSC_MAIN | SYSCTL_XTAL_16MHZ | SYSCTL_USE_PLL | SYSCTL_SYSDIV_4);

    InitI2C(I2C3_BASE, false);
    MPU_init();
   // UART_Init();


    val = IsMPUAvailable();
    printf("val = %d",val);

     if(val == 1)
    {
        while(1);

    }


    while(1)
    {   NVIC_EN0_R = 0x00000000;        /*  disable interrupt 5 in NVIC */
        DisableInterrupts();

        MPU_Start_Loc();
        MPU_Receive();

        compute_position( xa, ya, za, xg, yg,zg,&disp, &thetax,&thetay,&thetaz);

        UART_Init();
        UART1_ICR_R = 0x10;        /*  Clear flag4 */

        UART1_IM_R |= 0x10;        /*  arm interrupt on PF4 */

        NVIC_PRI1_R = (NVIC_PRI1_R & 0xFF1FFFFF) | 0x00C00000; /*  priority 5 */
        NVIC_EN0_R = 0x00000040;
        EnableInterrupts();


        //UART_Init();
                //memset(GPS_Buffer,0,15);
        LCD_String_xy(1,0,"UTC Time: ");
        Time = get_gpstime();            /* Extract Time */
        convert_time_to_UTC(Time);       /* convert time to UTC */
        LCD_String(Data_Buffer);
        LCD_String("  ");

        LCD_String_xy(2,0,"Lat: ");
        Latitude = get_latitude(GGA_Pointers[0]);   /* Extract Latitude */
        Latitude = convert_to_degrees(Latitude);    /* convert raw latitude in degree decimal*/
        intLat= (int)(Latitude*1000000);
        printf("%d\n",intLat);
                //LCD_String1(GPS_Buffer);                     /* display latitude in degree */
                //memset(GPS_Buffer,0,15);

        LCD_String_xy(3,0,"Long: ");
        Longitude = get_longitude(GGA_Pointers[2]); /* Extract Latitude */
        Longitude = convert_to_degrees(Longitude);  /* convert raw longitude in degree decimal*/
        intLong= (int)(Longitude*1000000);

        printf("%d\n",intLong);


        LCD_String_xy(4,0,"Alt: ");
        Altitude = get_altitude(GGA_Pointers[7]);   /* Extract Latitude */
        intAlt =(int)(Altitude*1000000);

        printf("%d\n",intAlt);

        //converting gps lat-long coordinates to cartesian frame
        conv_gps_lat_long(Latitude,Longitude,&GPS_pos_X,&GPS_pos_Y,&GPS_pos_Z);


        //Kalman filter for data fusion to be implemented here

        //Angle turned in X direction
        //sprintf(buffer," thetax = %.2f\r\n",thetax);
        intthetax =(int)(thetax*1000000);
        printf("%d\n",intthetax);

        //Angle turned in Y direction
        intthetay =(int)(thetay*1000000);
        printf("%d\n",intthetay);

        //ANgle turned in Z direction
        intthetaz =(int)(thetaz*1000000);
        printf("%d\n",intthetaz);

