akshaym1995/Embedded-project/TM4C123GH6PM/main.c
        //Displacement
        intdisp =(int)(disp*1000000);
        printf("%d\n",intdisp);


    }
 return 0;

}

/* Initialize I2C in slow or fast mode
 * uint32_t BASE: I2C0_BASE, I2C1_BASE, I2C2_BASE, I2C3_BASE
 * bool mode: false (100KHz), true (400KHz)
 */
void InitI2C(uint32_t BASE, bool mode)
{
    uint32_t SYSCTL_PERIPH_I2C, SYSCTL_PERIPH_GPIO;
    uint32_t CONF_PIN_SCL, CONF_PIN_SDA;
    uint32_t GPIO_PORT_BASE;
    uint32_t PIN_SCL, PIN_SDA;
    switch(BASE)
    {
        case I2C0_BASE: SYSCTL_PERIPH_I2C  =  SYSCTL_PERIPH_I2C0;
                        SYSCTL_PERIPH_GPIO =  SYSCTL_PERIPH_GPIOB;
                        CONF_PIN_SCL = GPIO_PB2_I2C0SCL;
                        CONF_PIN_SDA = GPIO_PB3_I2C0SDA;
                        GPIO_PORT_BASE = GPIO_PORTB_BASE;
                        PIN_SCL = GPIO_PIN_2;
                        PIN_SDA = GPIO_PIN_3;
                        break;

        case I2C1_BASE: SYSCTL_PERIPH_I2C  =  SYSCTL_PERIPH_I2C1;
                        SYSCTL_PERIPH_GPIO =  SYSCTL_PERIPH_GPIOA;
                        CONF_PIN_SCL = GPIO_PA6_I2C1SCL;
                        CONF_PIN_SDA = GPIO_PA7_I2C1SDA;
                        GPIO_PORT_BASE = GPIO_PORTA_BASE;
                        PIN_SCL = GPIO_PIN_6;
                        PIN_SDA = GPIO_PIN_7;
                        break;

        case I2C2_BASE: SYSCTL_PERIPH_I2C  =  SYSCTL_PERIPH_I2C2;
                        SYSCTL_PERIPH_GPIO =  SYSCTL_PERIPH_GPIOE;
                        CONF_PIN_SCL = GPIO_PE4_I2C2SCL;
                        CONF_PIN_SDA = GPIO_PE5_I2C2SDA;
                        GPIO_PORT_BASE = GPIO_PORTE_BASE;
                        PIN_SCL = GPIO_PIN_4;
                        PIN_SDA = GPIO_PIN_5;
                        break;

        case I2C3_BASE: SYSCTL_PERIPH_I2C  =  SYSCTL_PERIPH_I2C3;
                        SYSCTL_PERIPH_GPIO =  SYSCTL_PERIPH_GPIOD;
                        CONF_PIN_SCL = GPIO_PD0_I2C3SCL;
                        CONF_PIN_SDA = GPIO_PD1_I2C3SDA;
                        GPIO_PORT_BASE = GPIO_PORTD_BASE;
                        PIN_SCL = GPIO_PIN_0;
                        PIN_SDA = GPIO_PIN_1;
                        break;

        default:        while(1);

    }

    // Enable I2C
    SysCtlPeripheralEnable(SYSCTL_PERIPH_I2C);
    //Wait Until I2C is Ready
    while(!(SysCtlPeripheralReady(SYSCTL_PERIPH_I2C)));

    //Enable GPIO
    SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIO);
    //Wait Until GPIO is Ready
    while(!(SysCtlPeripheralReady(SYSCTL_PERIPH_GPIO)));


    GPIOPinConfigure(CONF_PIN_SCL);
    GPIOPinConfigure(CONF_PIN_SDA);

    GPIOPinTypeI2C(GPIO_PORT_BASE, PIN_SDA);
    GPIOPinTypeI2CSCL(GPIO_PORT_BASE, PIN_SCL);

    I2CMasterInitExpClk(BASE,SysCtlClockGet(),mode);

}



/* Checks if BMP180 Pressure sensor is present bus or not.
 * Returns 0 if sensor is found else returns 1.
 */


/* Checks if MPU Inertial sensor is present bus or not.
 * Returns 0 if sensor is found else returns 1.
 */
uint32_t IsMPUAvailable(void)
{
    uint32_t val;

    I2CMasterSlaveAddrSet(I2C3_BASE,0x68,false);
    I2CMasterDataPut(I2C3_BASE, 0x75);

    I2CMasterControl(I2C3_BASE, I2C_MASTER_CMD_SINGLE_SEND);
    while(I2CMasterBusy(I2C3_BASE));

    I2CMasterSlaveAddrSet(I2C3_BASE, 0x68, true);
    I2CMasterControl(I2C3_BASE, I2C_MASTER_CMD_SINGLE_RECEIVE);

    while(I2CMasterBusy(I2C3_BASE));

    if(I2CMasterErr(I2C3_BASE)!= 0)
    {
        return 1;
    }

    val = I2CMasterDataGet(I2C3_BASE);

    if(val == 0x68)
    {
        return 0;
    }
    else
    {
        return 1;
    }
}

void delayMs(int n)
{
int i, j;
for(i = 0 ; i < n; i++)
for(j = 0; j < 3180; j++) {}
     /* do nothing for 1 ms */
}

void MPU_init()
{
    delayMs(150);

    I2CMasterSlaveAddrSet(I2C3_BASE,0x68,false);
    I2CMasterControl(I2C3_BASE, I2C_MASTER_CMD_BURST_SEND_START);

    I2CMasterDataPut(I2C3_BASE, 0x6B);
    while(I2CMasterBusy(I2C3_BASE));
    I2CMasterDataPut(I2C3_BASE, 0x01);
    while(I2CMasterBusy(I2C3_BASE));

    I2CMasterDataPut(I2C3_BASE, 0x1A);
    while(I2CMasterBusy(I2C3_BASE));
   I2CMasterDataPut(I2C3_BASE, 0x03);
        while(I2CMasterBusy(I2C3_BASE));

    I2CMasterDataPut(I2C3_BASE, 0x19);
    while(I2CMasterBusy(I2C3_BASE));
    I2CMasterDataPut(I2C3_BASE, 0x00);
    while(I2CMasterBusy(I2C3_BASE));

    I2CMasterDataPut(I2C3_BASE, 0x1B);
        while(I2CMasterBusy(I2C3_BASE));
        I2CMasterDataPut(I2C3_BASE, 0x18);
        while(I2CMasterBusy(I2C3_BASE));

        I2CMasterDataPut(I2C3_BASE, 0x1C);
            while(I2CMasterBusy(I2C3_BASE));
            I2CMasterDataPut(I2C3_BASE, 0x10);
            while(I2CMasterBusy(I2C3_BASE));

            I2CMasterDataPut(I2C3_BASE, 0x1A);
                while(I2CMasterBusy(I2C3_BASE));
                I2CMasterDataPut(I2C3_BASE, 0x00);
                while(I2CMasterBusy(I2C3_BASE));

    I2CMasterControl(I2C3_BASE, I2C_MASTER_CMD_BURST_SEND_FINISH);
    while(I2CMasterBusy(I2C3_BASE));


 }

void MPU_Start_Loc()
{
    I2CMasterSlaveAddrSet(I2C3_BASE,0x68,false);
    I2CMasterDataPut(I2C3_BASE, 0x3B);

    I2CMasterControl(I2C3_BASE, I2C_MASTER_CMD_SINGLE_SEND);
    while(I2CMasterBusy(I2C3_BASE));

}

void MPU_Receive()
{
    int axh,axl,ayh,ayl,azh,azl,th,tl,gxh,gxl,gyh,gyl,gzh,gzl;


    I2CMasterSlaveAddrSet(I2C3_BASE,0x68,false);
    I2CMasterDataPut(I2C3_BASE, 0x3B);

    I2CMasterControl(I2C3_BASE, I2C_MASTER_CMD_SINGLE_SEND);
    while(I2CMasterBusy(I2C3_BASE));


    I2CMasterSlaveAddrSet(I2C3_BASE, 0x68, true);
            I2CMasterControl(I2C3_BASE, I2C_MASTER_CMD_SINGLE_RECEIVE);
            if(I2CMasterErr(I2C3_BASE)!= 0)
            {
                    return 1;
            }

            axl = I2CMasterDataGet(I2C3_BASE);
            //printf("axl : %d",axl);
            //MPU_Start_Loc();

            I2CMasterSlaveAddrSet(I2C3_BASE,0x68,false);
            I2CMasterDataPut(I2C3_BASE, 0x3C);

                I2CMasterControl(I2C3_BASE, I2C_MASTER_CMD_SINGLE_SEND);
                while(I2CMasterBusy(I2C3_BASE));


                I2CMasterSlaveAddrSet(I2C3_BASE, 0x68, true);
                        I2CMasterControl(I2C3_BASE, I2C_MASTER_CMD_SINGLE_RECEIVE);
                        if(I2CMasterErr(I2C3_BASE)!= 0)
                        {
                                return 1;
                        }

