akshaym1995/Embedded-project/TM4C123GH6PM/main.c
            axh = I2CMasterDataGet(I2C3_BASE);
            //MPU_Start_Loc();
          //  printf("axh : %d",axh);

            I2CMasterSlaveAddrSet(I2C3_BASE,0x68,false);
            I2CMasterDataPut(I2C3_BASE, 0x3D);

            I2CMasterControl(I2C3_BASE, I2C_MASTER_CMD_SINGLE_SEND);
            while(I2CMasterBusy(I2C3_BASE));

            I2CMasterSlaveAddrSet(I2C3_BASE, 0x68, true);

            I2CMasterControl(I2C3_BASE, I2C_MASTER_CMD_SINGLE_RECEIVE);

                if(I2CMasterErr(I2C3_BASE)!= 0)
                        {
                            return 1;
                        }

                ayl = I2CMasterDataGet(I2C3_BASE);
                //printf("ayl : %d",ayl);

              //  MPU_Start_Loc();
                I2CMasterSlaveAddrSet(I2C3_BASE,0x68,false);
                         I2CMasterDataPut(I2C3_BASE, 0x3E);

                         I2CMasterControl(I2C3_BASE, I2C_MASTER_CMD_SINGLE_SEND);
                         while(I2CMasterBusy(I2C3_BASE));

                         I2CMasterSlaveAddrSet(I2C3_BASE, 0x68, true);

                         I2CMasterControl(I2C3_BASE, I2C_MASTER_CMD_SINGLE_RECEIVE);

                    if(I2CMasterErr(I2C3_BASE)!= 0)
                            {
                                return 1;
                            }

                    ayh = I2CMasterDataGet(I2C3_BASE);
                   // printf("ayh : %d",ayh);
                   // I2CMasterControl(I2C3_BASE, I2C_MASTER_CMD_BURST_RECEIVE_FINISH);
                 //   MPU_Start_Loc();


                    I2CMasterSlaveAddrSet(I2C3_BASE,0x68,false);
                                I2CMasterDataPut(I2C3_BASE, 0x3F);

                                I2CMasterControl(I2C3_BASE, I2C_MASTER_CMD_SINGLE_SEND);
                                while(I2CMasterBusy(I2C3_BASE));

                                I2CMasterSlaveAddrSet(I2C3_BASE, 0x68, true);

                    I2CMasterControl(I2C3_BASE,I2C_MASTER_CMD_SINGLE_RECEIVE);
                        if(I2CMasterErr(I2C3_BASE)!= 0)
                                {
                                    return 1;
                                }


                        azl = I2CMasterDataGet(I2C3_BASE);
                       // printf("azl : %d",azl);
                     //   MPU_Start_Loc();

                        I2CMasterSlaveAddrSet(I2C3_BASE,0x68,false);
                                                    I2CMasterDataPut(I2C3_BASE, 0x40);

                                                    I2CMasterControl(I2C3_BASE, I2C_MASTER_CMD_SINGLE_SEND);
                                                    while(I2CMasterBusy(I2C3_BASE));

                                   I2CMasterSlaveAddrSet(I2C3_BASE, 0x68, true);

                               I2CMasterControl(I2C3_BASE,I2C_MASTER_CMD_SINGLE_RECEIVE);

                            if(I2CMasterErr(I2C3_BASE)!= 0)
                                    {
                                        return 1;
                                    }


                            azh = I2CMasterDataGet(I2C3_BASE);
                            //printf("azh : %d",azh);
                            //printf("\n");

                            I2CMasterSlaveAddrSet(I2C3_BASE,0x68,false);
                                                        I2CMasterDataPut(I2C3_BASE, 0x41);

                                                        I2CMasterControl(I2C3_BASE, I2C_MASTER_CMD_SINGLE_SEND);
                                                        while(I2CMasterBusy(I2C3_BASE));

                                       I2CMasterSlaveAddrSet(I2C3_BASE, 0x68, true);

                                   I2CMasterControl(I2C3_BASE,I2C_MASTER_CMD_SINGLE_RECEIVE);

                                if(I2CMasterErr(I2C3_BASE)!= 0)
                                        {
                                            return 1;
                                        }


                                tl = I2CMasterDataGet(I2C3_BASE);
                                //printf("tl : %d",tl);


                                I2CMasterSlaveAddrSet(I2C3_BASE,0x68,false);
                                                            I2CMasterDataPut(I2C3_BASE, 0x42);

                                                            I2CMasterControl(I2C3_BASE, I2C_MASTER_CMD_SINGLE_SEND);
                                                            while(I2CMasterBusy(I2C3_BASE));

                                           I2CMasterSlaveAddrSet(I2C3_BASE, 0x68, true);

                                       I2CMasterControl(I2C3_BASE,I2C_MASTER_CMD_SINGLE_RECEIVE);

                                    if(I2CMasterErr(I2C3_BASE)!= 0)
                                            {
                                                return 1;
                                            }


                                    th = I2CMasterDataGet(I2C3_BASE);
                                    //printf("th  : %d",th);
                                    //printf("\n");


                                    I2CMasterSlaveAddrSet(I2C3_BASE,0x68,false);
                                                                I2CMasterDataPut(I2C3_BASE, 0x43);

                                                                I2CMasterControl(I2C3_BASE, I2C_MASTER_CMD_SINGLE_SEND);
                                                                while(I2CMasterBusy(I2C3_BASE));

                                               I2CMasterSlaveAddrSet(I2C3_BASE, 0x68, true);

                                           I2CMasterControl(I2C3_BASE,I2C_MASTER_CMD_SINGLE_RECEIVE);

                                        if(I2CMasterErr(I2C3_BASE)!= 0)
                                                {
                                                    return 1;
                                                }


                                        gxl = I2CMasterDataGet(I2C3_BASE);
                                       // printf("gxl : %d",gxl);

                                        I2CMasterSlaveAddrSet(I2C3_BASE,0x68,false);
                                                                    I2CMasterDataPut(I2C3_BASE, 0x44);

                                                                    I2CMasterControl(I2C3_BASE, I2C_MASTER_CMD_SINGLE_SEND);
                                                                    while(I2CMasterBusy(I2C3_BASE));

                                                   I2CMasterSlaveAddrSet(I2C3_BASE, 0x68, true);

                                               I2CMasterControl(I2C3_BASE,I2C_MASTER_CMD_SINGLE_RECEIVE);

                                            if(I2CMasterErr(I2C3_BASE)!= 0)
                                                    {
                                                        return 1;
                                                    }


