akshaym1995/Embedded-project/TM4C123GH6PM/main.c
                                            gxh = I2CMasterDataGet(I2C3_BASE);
                                            //printf("gxh :%d",gxh);

                                            I2CMasterSlaveAddrSet(I2C3_BASE,0x68,false);
                                                                        I2CMasterDataPut(I2C3_BASE, 0x45);

                                                                        I2CMasterControl(I2C3_BASE, I2C_MASTER_CMD_SINGLE_SEND);
                                                                        while(I2CMasterBusy(I2C3_BASE));

                                                       I2CMasterSlaveAddrSet(I2C3_BASE, 0x68, true);

                                                   I2CMasterControl(I2C3_BASE,I2C_MASTER_CMD_SINGLE_RECEIVE);

                                                if(I2CMasterErr(I2C3_BASE)!= 0)
                                                        {
                                                            return 1;
                                                        }


                                                gyl = I2CMasterDataGet(I2C3_BASE);
                                                //printf("gyl: %d",gyl);

                                                I2CMasterSlaveAddrSet(I2C3_BASE,0x68,false);
                                                                            I2CMasterDataPut(I2C3_BASE, 0x46);

                                                                            I2CMasterControl(I2C3_BASE, I2C_MASTER_CMD_SINGLE_SEND);
                                                                            while(I2CMasterBusy(I2C3_BASE));

                                                           I2CMasterSlaveAddrSet(I2C3_BASE, 0x68, true);

                                                       I2CMasterControl(I2C3_BASE,I2C_MASTER_CMD_SINGLE_RECEIVE);

                                                    if(I2CMasterErr(I2C3_BASE)!= 0)
                                                            {
                                                                return 1;
                                                            }


                                                    gyh = I2CMasterDataGet(I2C3_BASE);
                                                    //printf("gyh : %d",gyh);

                                                    I2CMasterSlaveAddrSet(I2C3_BASE,0x68,false);
                                                                                I2CMasterDataPut(I2C3_BASE, 0x47);

                                                                                I2CMasterControl(I2C3_BASE, I2C_MASTER_CMD_SINGLE_SEND);
                                                                                while(I2CMasterBusy(I2C3_BASE));

                                                               I2CMasterSlaveAddrSet(I2C3_BASE, 0x68, true);

                                                           I2CMasterControl(I2C3_BASE,I2C_MASTER_CMD_SINGLE_RECEIVE);

                                                        if(I2CMasterErr(I2C3_BASE)!= 0)
                                                                {
                                                                    return 1;
                                                                }


                                                        gzl = I2CMasterDataGet(I2C3_BASE);
                                                        //printf("gzl: %d",gzl);

                                                        I2CMasterSlaveAddrSet(I2C3_BASE,0x68,false);
                                                                                    I2CMasterDataPut(I2C3_BASE, 0x48);

                                                                                    I2CMasterControl(I2C3_BASE, I2C_MASTER_CMD_SINGLE_SEND);
                                                                                    while(I2CMasterBusy(I2C3_BASE));

                                                                   I2CMasterSlaveAddrSet(I2C3_BASE, 0x68, true);

                                                               I2CMasterControl(I2C3_BASE,I2C_MASTER_CMD_SINGLE_RECEIVE);

                                                            if(I2CMasterErr(I2C3_BASE)!= 0)
                                                                    {
                                                                        return 1;
                                                                    }


                                                            gzh = I2CMasterDataGet(I2C3_BASE);
                                                          //  printf("gzh: %d",gzh);
                                                            //printf("\n");

                                                            xa = (float)((256*axh +axl)/16384);
                                                            ya = (float)((256*ayh +ayl)/16384);
                                                            za = (float)((256*azh +azl)/16384);

                                                            T= (float)(256*th + tl);
                                                            T = (T/340) + 36.53;

                                                            xg = (float)((256*gxh + gxl)/131);
                                                            yg = (float)((256*gyh + gyl)/131);
                                                            zg = (float)((256*gzh + gzl)/131);

                                                            printf("Ax: %f \t Ay: %f \t Az: %f \t T: %f \t Gx: %f \t Gy: %f \t Gz: %f \t ",xa,ya,za,T,xg,yg,zg);
                                                            printf("\n");


    }

